// Вывести квадрат числа

Console.Write("Введите число: ");
double a =Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Math.Pow(a, 2));
