// Написать программу вычисления значения функции y=f(a)
// double a = 5;
// double y;

// Console.WriteLine(y = Math.Pow(a,2)+1);

double Y(double x)
{
    return x*x;
}
Console.WriteLine(Y(3));